HTML_and_CSS_Design_and_Build_Websites/017.HTML5_Layout/017.000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-13 Thu 11:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 17: HTML5 Layout</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../resources/bulma/bulma.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Chapter 17: HTML5 Layout</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8eb6df5">Navigation</a></li>
<li><a href="#orgbe9b700">Notes</a>
<ul>
<li><a href="#org4191a4c">Section 17.1: New HTML5 Layout Elements</a></li>
<li><a href="#org2dccd7a">Section 17.2: Headers &amp; Footers</a></li>
<li><a href="#org0f5e524">Section 17.3: Navigation &amp; Articles</a></li>
<li><a href="#org68ca9b5">Section 17.4: Asides &amp; Sections</a></li>
<li><a href="#orgcc2ca31">Section 17.5: Heading Groups &amp; Figures</a></li>
<li><a href="#org0318653">Section 17.6: Sectioning Elements and Linking Around Block-Level Elements</a></li>
<li><a href="#orgd164d20">Section 17.7: Summary</a></li>
<li><a href="#org7df90ea">Section 17.8: Chapter Exercise Example</a></li>
</ul>
</li>
<li><a href="#orgfca513f">Keywords</a></li>
<li><a href="#org91fc012">Questions</a></li>
<li><a href="#org04c17f3">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8eb6df5" class="outline-2">
<h2 id="org8eb6df5">Navigation</h2>
<div class="outline-text-2" id="text-org8eb6df5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Nav</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Links</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Index</td>
<td class="org-left">Notes Home</td>
<td class="org-left">&vert; <a href="../../index.html">html</a> &vert; <a href="../../index.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Home</td>
<td class="org-left">HTML &amp; CSS - Design and Build Websites</td>
<td class="org-left">&vert; <a href="../000.Home.html">html</a> &vert; <a href="../000.Home.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Prev</td>
<td class="org-left">Chapter 16: Images</td>
<td class="org-left">&vert; <a href="../016.Images/016.000.Notes.html">html</a> &vert; <a href="../016.Images/016.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/016.Images">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Next</td>
<td class="org-left">Chapter 18: Process &amp; Design</td>
<td class="org-left">&vert; <a href="../018.Process_and_Design/018.000.Notes.html">html</a> &vert; <a href="../018.Process_and_Design/018.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/018.Process_and_Design">github</a> &vert;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgbe9b700" class="outline-2">
<h2 id="orgbe9b700">Notes</h2>
<div class="outline-text-2" id="text-orgbe9b700">
</div>
<div id="outline-container-org4191a4c" class="outline-3">
<h3 id="org4191a4c">Section 17.1: New HTML5 Layout Elements</h3>
<div class="outline-text-3" id="text-org4191a4c">
<ul class="org-ul">
<li>Before HTML5, web page authors used <code>&lt;div&gt;</code> elements to group together related elements on the page (such as the elements that form a header, an artcle, footer or sidebar)</li>
<li>Authors used <code>class</code> or <code>id</code> attributes to indicate the role of the <code>&lt;div&gt;</code> element in the structure of the page</li>
<li>HTML5 introduces a new set of elements that allow you to divide up the parts of the page</li>
<li>The names of these elements indicate the kind of content you will find in them (e.g. <code>&lt;header&gt;</code>, <code>&lt;nav&gt;</code>, etc.)</li>
<li>The point of creating these new elements is so that web page authors can use them to help describe the structure of the page</li>
<li>For example, screen reader software might allow users to ignore headers and footers and get straight to the content</li>
<li>Plus it also makes the code easier to follow</li>
</ul>
</div>
</div>

<div id="outline-container-org2dccd7a" class="outline-3">
<h3 id="org2dccd7a">Section 17.2: Headers &amp; Footers</h3>
<div class="outline-text-3" id="text-org2dccd7a">
<ul class="org-ul">
<li>The <code>&lt;header&gt;</code> and <code>&lt;footer&gt;</code> eleemnts can be used for:
<ul class="org-ul">
<li>The main header or footer that appears at the top or bottom of every page on the site</li>
<li>Or a header or footer can be used for an individual <code>&lt;article&gt;</code> or <code>&lt;section&gt;</code> within the page</li>
</ul></li>
<li>The <code>&lt;header&gt;</code> can contain the name and logo of the website and the navigation links</li>
<li>The <code>&lt;footer&gt;</code> can contain copyright information, privacy policy, and terms and conditions</li>
<li>Inside an <code>&lt;article&gt;</code> or <code>&lt;section&gt;</code> the header and footer can hold information for that article or section as well (e.g. the title of the section in the header and in the footer it can be share buttons for that section)</li>
</ul>
</div>
</div>

<div id="outline-container-org0f5e524" class="outline-3">
<h3 id="org0f5e524">Section 17.3: Navigation &amp; Articles</h3>
<div class="outline-text-3" id="text-org0f5e524">
<ul class="org-ul">
<li><code>&lt;nav&gt;</code> element is used to contain the major navigational blocks on the site such as the primary site navigation</li>
<li>This is only for major navigational blocks not just for any type of links</li>
<li><code>&lt;article&gt;</code> elements acts as a container for any section of a page that could stand alone and potentially be syndicated</li>
<li>This could be an individual article or blog entry, a comment or forum post, or any other independent piece of content</li>
<li>If a page contains several articles (or even summaries of several articles), then each individual article would live inside its own <code>&lt;article&gt;</code> element</li>
<li>The <code>&lt;article&gt;</code> elements can even be nested inside each other (e.g. a blog post is inside <code>&lt;article&gt;</code> and each comment on the article could live inside its own child <code>&lt;article&gt;</code> element)</li>
</ul>
</div>
</div>

<div id="outline-container-org68ca9b5" class="outline-3">
<h3 id="org68ca9b5">Section 17.4: Asides &amp; Sections</h3>
<div class="outline-text-3" id="text-org68ca9b5">
<ul class="org-ul">
<li>The <code>&lt;aside&gt;</code> element has two purposes depending on whether it is inside an <code>&lt;article&gt;</code> element or not</li>
<li>When the <code>&lt;aside&gt;</code> element is used inside an <code>&lt;article&gt;</code> element, it should contain information that is related to the article but not essential to its overall meaning (like a glossary or a pull-quote, basically a attention-catching quote from the article)</li>
<li>When the <code>&lt;aside&gt;</code> element is used outside of an <code>&lt;article&gt;</code> element, it acts as acontainer for content that is related to the entire page but not essential to the overall meaning (e.g. links to other sections, list of recent posts, a search box, recent social media posts, etc.)</li>
<li>The <code>&lt;section&gt;</code> element groups related content together, and typically each section would have its own heading</li>
<li>For example, on a homepage there may be several <code>&lt;section&gt;</code> elements to contain different sections of the page, such as latest news, top products, and newsletter signup</li>
<li>Because the <code>&lt;section&gt;</code> element groups related items together it may contain several distinct <code>&lt;article&gt;</code> elements that have a common theme or purpose</li>
<li>Alternatively, if you have a page with a long article, the <code>&lt;section&gt;</code> element can be used to split the article up into separate sections</li>
<li>The <code>&lt;section&gt;</code> element should not be used as a wrapper for the entire page (unles the page only contains one distinct piece of content)</li>
<li>If you want a containing element for the entire page, that job is still bet left to the <code>&lt;div&gt;</code> element</li>
</ul>
</div>
</div>
