HTML_and_CSS_Design_and_Build_Websites/017.HTML5_Layout/017.000.Notes.html

<div id="outline-container-orgcc2ca31" class="outline-3">
<h3 id="orgcc2ca31">Section 17.5: Heading Groups &amp; Figures</h3>
<div class="outline-text-3" id="text-orgcc2ca31">
<ul class="org-ul">
<li>The purpose of the <code>&lt;hgroup&gt;</code> element is to group together a set of one or more <code>&lt;h1&gt;</code> through <code>&lt;h6&gt;</code> elements so that they are treated as one single heading</li>
<li>For example, the <code>&lt;hgroup&gt;</code> element could be used to contain both a title inside an <code>&lt;h2&gt;</code> element and a subtitle within an <code>&lt;h3&gt;</code> element</li>
<li><code>&lt;figure&gt;</code> can be used to contain any content that is referenced from the main flow of an article (not just images)</li>
<li>It is important to note that the article should still make sense if the content of the <code>&lt;figure&gt;</code> element were moved to another part of the page or even to a different page altogether</li>
<li>For this reason, it should only be used when the content simply references the element (and not for something that is absolutely integral to the flow of a page)</li>
<li>Examples include: images, videos, graphs, diagrams, code samples, text that supports the main body of an article</li>
<li><code>&lt;figure&gt;</code> should also contain a <code>&lt;figcaption&gt;</code> element which provides a text description for the content of the <code>&lt;figure&gt;</code> element</li>
</ul>
</div>
</div>

<div id="outline-container-org0318653" class="outline-3">
<h3 id="org0318653">Section 17.6: Sectioning Elements and Linking Around Block-Level Elements</h3>
<div class="outline-text-3" id="text-org0318653">
<ul class="org-ul">
<li>Although we have new elements, the <code>&lt;div&gt;</code> element will remain an important way to group together related elements because you should not be using these new elements that you have just met for purposes other than those explicitly stated</li>
<li>When there is no suitable element to group a set of elements, the <code>&lt;div&gt;</code> element will still be used</li>
<li>Why is there no <code>&lt;content&gt;</code> element for the main content? Well you can consider anything outside <code>&lt;header&gt;</code>, <code>&lt;footer&gt;</code>, or <code>&lt;aside&gt;</code> as the main content</li>
<li>Also with HTML5, you can place an <code>&lt;a&gt;</code> element around a block level element that contains child elements thus turning an entire block into a link (in previous HTML versions this was considered incorrect usage)</li>
</ul>
</div>
</div>

<div id="outline-container-orgd164d20" class="outline-3">
<h3 id="orgd164d20">Section 17.7: Summary</h3>
<div class="outline-text-3" id="text-orgd164d20">
<ul class="org-ul">
<li>The new HTML5 elements indicate the purpose of different parts of a web page and help to describe its structure</li>
<li>The new elements provide clearer code compared with only using <code>&lt;div&gt;</code> elements</li>
</ul>
</div>
</div>

<div id="outline-container-org7df90ea" class="outline-3">
<h3 id="org7df90ea">Section 17.8: Chapter Exercise Example</h3>
<div class="outline-text-3" id="text-org7df90ea">
<ul class="org-ul">
<li><a href="./017.008.Chapter_Exercise_Example/index.html">Here</a> is the chapter's exercise example</li>
</ul>
</div>
</div>
</div>
