HTML_and_CSS_Design_and_Build_Websites/017.HTML5_Layout/017.000.Notes.html


<div id="outline-container-orgfca513f" class="outline-2">
<h2 id="orgfca513f">Keywords</h2>
<div class="outline-text-2" id="text-orgfca513f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>&lt;header&gt;</code></td>
<td class="org-left">According to Mozilla, this element represents introductory content, typically a group of introductory or navigational aids such as logo, search form, author name, and other elements, and the header can be used for a sectioning element not just the entire webpage (<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/header">Mozilla Docs</a>)</td>
</tr>

<tr>
<td class="org-left"><code>&lt;footer&gt;</code></td>
<td class="org-left">According to Mozilla, this element represents a footer for its nearest ancestor sectioning content or sectioning root element containing information such as author of the section, copyright data or links to related documents (<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/footer">Mozilla Docs</a>)</td>
</tr>

<tr>
<td class="org-left"><code>&lt;nav&gt;</code></td>
<td class="org-left">According to Mozilla, this element represents a section of a page whose purpose is to provide navigation links either within the current document or to other documents, examples include menus, table of contents, and indexes (<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/nav">Mozilla Docs</a>)</td>
</tr>

<tr>
<td class="org-left"><code>&lt;article&gt;</code></td>
<td class="org-left">According to Mozilla, this element represents a self-contained composition in a document, page, application, or site, which is intended to be independently distributable or resuable (e.g. in syndication), examples include a form post, a magazine or newspaper article, a blog entry, a product card, a user-submitted comment, an interactive widget or gadget, or any other independent item of content (<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/article">Mozilla Docs</a>)</td>
</tr>

<tr>
<td class="org-left"><code>&lt;aside&gt;</code></td>
<td class="org-left">According to Mozilla, this element represents a portion of a document whose content is only indirectly related to the document's main content but not essential to the main content such as pull-quotes and often presented as sidebars or call-out boxes (<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/aside">Mozilla Docs</a>)</td>
</tr>

<tr>
<td class="org-left"><code>&lt;section&gt;</code></td>
<td class="org-left">According to Mozilla, this element represents a generic standalone section of a document which doesn't have a more specific semantic element to represent it and sections should always have a heading with very few exceptions (<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/section">Mozilla Docs</a>)</td>
</tr>

<tr>
<td class="org-left"><code>&lt;hgroup&gt;</code></td>
<td class="org-left">According to Mozilla, this element represents a heading which groups a single <code>&lt;h1&gt;</code> to <code>&lt;h6&gt;</code> element with one o more <code>&lt;p&gt;</code>, according to the docs, the permitted content is zero or more <code>&lt;p&gt;</code> followed by one <code>&lt;h1&gt;</code> to <code>&lt;h6&gt;</code> followed by zero or more <code>&lt;p&gt;</code> but in the book and online it states <code>&lt;hgroup&gt;</code> can be used to group two or more <code>&lt;h1&gt;</code> to <code>&lt;h6&gt;</code> but I'll stick to the <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/hgroup">Mozilla Docs</a> because I think the <code>&lt;hgroup&gt;</code> definition has changed over time</td>
</tr>

<tr>
<td class="org-left"><code>&lt;figure&gt;</code></td>
<td class="org-left">According to Mozilla, this element represetns self-contained content scuh as an image, illustration, diagram, code snippet, etc. that is referenced in the main flow of a document but can be moved to another part of the document or toan appendix without affecting the main flow, an optional caption can be specified using <code>&lt;figcaption&gt;</code> and the whole figure with its caption is referenced as a single unit (<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/figure">Mozilla Docs</a>)</td>
</tr>

<tr>
<td class="org-left"><code>&lt;figcaption&gt;</code></td>
<td class="org-left">According to Mozilla, this element represents a caption or legend describing the rest of the contents of its parent <code>&lt;figure&gt;</code> element providing the <code>&lt;figure&gt;</code> an accessible description (<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/figcaption">Mozilla Docs</a>)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org91fc012" class="outline-2">
<h2 id="org91fc012">Questions</h2>
<div class="outline-text-2" id="text-org91fc012">
<ul class="org-ul">
<li><b>Q</b>: What are some examples for <code>&lt;article&gt;</code> and <code>&lt;section&gt;</code>?
<ul class="org-ul">
<li>For example, <code>&lt;article&gt;</code> can be used for single comments in a blog post, why? Because each comment is a self-contained composition which can be independently distributable (e.g. show in an ad, highlighted comment / review, etc.) and each comment does not reference each other</li>
<li>Another example could be reviews, each review can be placed inside an <code>&lt;article&gt;</code> because it is a independent self-contained composition in relation to its parent (e.g. a section in the page for reviews)</li>
<li>An example for <code>&lt;section&gt;</code> could be you are writing about a topic and you divide a topic into sub-topics and each sub-topic can be its own <code>&lt;section&gt;</code></li>
<li>Another example could be let's say you have an e-commerce and you have top picks, newly added products, and for-you products, then each section of the page can be inside <code>&lt;section&gt;</code></li>
</ul></li>

<li><b>Q</b>: What is the purpose of <code>&lt;hgroup&gt;</code>? Is it used for the overall site's heading or any type of headings?
<ul class="org-ul">
<li>I found this <a href="https://forum.freecodecamp.org/t/real-life-use-of-hgroup/603858/2">forum</a> inside freecodecamp.org which discusses about <code>&lt;hrgroup&gt;</code></li>
<li>Apparently before you could have added multiple headings inside <code>&lt;hgroup&gt;</code> but the definition has changed to only allow one heading and one or more paragraph element</li>
<li>The purpose of <code>&lt;hgroup&gt;</code> is to add a subtitle or a little title description</li>
<li><p>
For example, let's say you want to talk about ACM you could do something like:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;hgroup&gt;
  &lt;h1&gt;ACM&lt;/h1&gt;
  &lt;p&gt;Advancing Computing as a Science &amp; Profession&lt;/p&gt;
&lt;/hgroup&gt;
</pre>
</div></li>
<li>The <code>&lt;hgroup&gt;</code> can be used for the whole page, for the heading of a section, or anywhere where you could use a heading along with a subtitle</li>
<li>It is not restricted to just the whole page, it can go anywhere where a regular heading would be used</li>
</ul></li>
</ul>
</div>
</div>
