Web/HTML_and_CSS_Design_and_Build_Websites/017.HTML5_Layout/017.000.Notes.org
* Summary
  - Before HTML5 developers would use ~<div>~ element to group together related elements on a page (e.g. nav, headers, footers, etc.) using ~class~ or ~id~
  - HTML5 introduces new semantic elements that serve like ~<div>~ but for specific purposes, it allows you to divide up parts of the page and the name of these elements indicate the kind of content you will find in them
  - These new elements allow screen readers understand better the content on a page and allows the code to be easier to follow
  - ~<header>~ can be used for the header of the page, an individual ~<article>~ or an individual ~<section>~ and this element can contain the name and logo of the website and the navigation links
  - ~<footer>~ can also be used for the web page, an individual ~<article>~ or an individual ~<section>~ and this element can hold information such as copyright, privacy policy, terms and conditions, etc.
  - ~<nav>~ is used to contain the *major* navigational blocks on the site such as the primary site navigation
  - ~<article>~ acts as a container for any section of a page that could stand alone (e.g. an individual blog entry) and ~<article>~ elements can even be nested inside each other (e.g. inside a block entry, an ~<article>~ element is used for individual comments)
  - ~<aside>~ is a container for any section related to its parent (e.g. an ~<article>~ or the entire page) but not essential to the overall meaning (e.g. glossary, pull-quote, or some other thing)
  - ~<section>~ groups related content together (e.g. in a page there may be several ~<section>~ to contain different sections of the page, such as latest news, top products, etc.) and typically each section would have its own heading
  - ~<section>~ may contain several distinct ~<article>~ elements that have a common theme or purpose
  - ~<hgroup>~ element is to group together a set of one or more ~<h1>~ through ~<h6>~ elements so that they can be treated as a single heading
  - ~<figure>~ is used to contain content that is referenced from the main flow of an article such as images, videos, graphs, diagrams, code samples, text that supports the main body of an article etc.
  - ~<figure>~ should also contain a ~<figcaption>~ element which provides a text description for the content of the ~<figure>~ element
  - These new elements do not get rid of ~<div>~, these elements should only be used for what they have been intended for and when no suitable HTML5 semantic element applies then you should still be using ~<div>~  
