HTML_and_CSS_Design_and_Build_Websites/017.HTML5_Layout/017.000.Notes.html

<div id="outline-container-org04c17f3" class="outline-2">
<h2 id="org04c17f3">Summary</h2>
<div class="outline-text-2" id="text-org04c17f3">
<ul class="org-ul">
<li>Before HTML5 developers would use <code>&lt;div&gt;</code> element to group together related elements on a page (e.g. nav, headers, footers, etc.) using <code>class</code> or <code>id</code></li>
<li>HTML5 introduces new semantic elements that serve like <code>&lt;div&gt;</code> but for specific purposes, it allows you to divide up parts of the page and the name of these elements indicate the kind of content you will find in them</li>
<li>These new elements allow screen readers understand better the content on a page and allows the code to be easier to follow</li>
<li><code>&lt;header&gt;</code> can be used for the header of the page, an individual <code>&lt;article&gt;</code> or an individual <code>&lt;section&gt;</code> and this element can contain the name and logo of the website and the navigation links</li>
<li><code>&lt;footer&gt;</code> can also be used for the web page, an individual <code>&lt;article&gt;</code> or an individual <code>&lt;section&gt;</code> and this element can hold information such as copyright, privacy policy, terms and conditions, etc.</li>
<li><code>&lt;nav&gt;</code> is used to contain the <b>major</b> navigational blocks on the site such as the primary site navigation</li>
<li><code>&lt;article&gt;</code> acts as a container for any section of a page that could stand alone (e.g. an individual blog entry) and <code>&lt;article&gt;</code> elements can even be nested inside each other (e.g. inside a block entry, an <code>&lt;article&gt;</code> element is used for individual comments)</li>
<li><code>&lt;aside&gt;</code> is a container for any section related to its parent (e.g. an <code>&lt;article&gt;</code> or the entire page) but not essential to the overall meaning (e.g. glossary, pull-quote, or some other thing)</li>
<li><code>&lt;section&gt;</code> groups related content together (e.g. in a page there may be several <code>&lt;section&gt;</code> to contain different sections of the page, such as latest news, top products, etc.) and typically each section would have its own heading</li>
<li><code>&lt;section&gt;</code> may contain several distinct <code>&lt;article&gt;</code> elements that have a common theme or purpose</li>
<li><code>&lt;hgroup&gt;</code> element is to group together a set of one or more <code>&lt;h1&gt;</code> through <code>&lt;h6&gt;</code> elements so that they can be treated as a single heading</li>
<li><code>&lt;figure&gt;</code> is used to contain content that is referenced from the main flow of an article such as images, videos, graphs, diagrams, code samples, text that supports the main body of an article etc.</li>
<li><code>&lt;figure&gt;</code> should also contain a <code>&lt;figcaption&gt;</code> element which provides a text description for the content of the <code>&lt;figure&gt;</code> element</li>
<li>These new elements do not get rid of <code>&lt;div&gt;</code>, these elements should only be used for what they have been intended for and when no suitable HTML5 semantic element applies then you should still be using <code>&lt;div&gt;</code></li>
</ul>
</div>
</div>
</div>
</body>
</html>
